Repository: songwut/GrabShot
Catalog: GrabShot/Localizable.xcstrings
Source language: en
Languages: ru

source: %lld frames
ru: %lld кадров

source: %lld streams
ru: %lld потоков

source: About application GrabShot
ru: О приложении GrabShot

source: Add write access for directory.
ru: Добавьте доступ записи для каталога.

source: Additional options
ru: Дополнительные опции

source: After importing the images, select the desired frame in the left navigation bar. The frame will appear in the working window. Choose one of the methods and algorithms for color selection. If you want to exclude black and white colors, then select the desired option. To pin the result under the image, click export or export all.
ru: После импорта изображений выберите нужный кадр на левой панели навигации. Рамка появится в рабочем окне. Выберите один из методов и алгоритмов выделения цвета. Если вы хотите исключить черный и белый цвета, то выберите нужный вариант. Чтобы закрепить результат под изображением, нажмите экспортировать или экспортировать все.

source: After importing the video, you will be taken to the video grab tab.
ru: После импорта видео вы попадете на вкладку захвата видео.

source: Algorithm
ru: Алгоритм

source: already exists on path
ru: уже существует по адресу

source: An application for capturing frames from videos and extracting colors
ru: Приложение для захвата кадров из видео и извлечения цвета

source: App
ru: Приложение

source: Area average color
ru: Средний цвет по сегментам

source: Automatically cleared after closing the application
ru: Автоматически очищается после закрытия приложения

source: Average Color
ru: Средний цвет

source: Barcode height
ru: Высота штрих-кода

source: Browse
ru: Выбрать

source: Cache for video
ru: Кеш для видео

source: Cache settings
ru: Настройки кэша

source: caching...
ru: кеширование...

source: Calculating
ru: Расчёт

source: Can't get duration of video by path
ru: Не удается получить продолжительность для видео по расположению

source: Can't get export directory
ru: Не удается получить папку экспорта

source: Can't get write access to export folder
ru: Не удается получить доступ записи в папке экспорта

source: Can't grab shot in
ru: Не получается сделать скриншот

source: Cancel
ru: Отмена

source: Canceled
ru: Отменено

source: Cannot decode metadata
ru: Не удается декодировать метаданные

source: Check the image URL %@.
ru: Проверьте URL-адрес изображения %@.

source: Check the video link to ensure it is correct.
ru: Проверьте ссылку на видео, чтобы убедиться, что она верна.

source: Check your video link.
ru: Проверьте ссылку на видео.

source: Choose an image
ru: Выберите изображение

source: CIE76 algorithm calculates difference in Lab color space.
ru: Алгоритм CIE76 вычисляет разницу в цветовом пространстве Lab.

source: Cleaning...
ru: Чистка...

source: Clear
ru: Очистить

source: Clear %@
ru: Очистить %@

source: Color difference
ru: Разница в цвете

source: Color extraction
ru: Выделение цвета

source: Color strip
ru: Цветовой штрих-код

source: colors
ru: цветов

source: Command error
ru: В команде ошибка

source: Complete
ru: Готово

source: Computes the Euclidean distance in RGB color space.
ru: Вычисляет евклидово расстояние в цветовом пространстве RGB.

source: Congratulations!
ru: Поздравляем!

source: Control panel
ru: Панель управления

source: Copy
ru: Копировать

source: Copy color
ru: Копировать цвет

source: Copy the original audio and video without re-encoding into a QuickTime container.
ru: Копирование исходного аудио и видео без перекодирования в контейнер QuickTime.

source: Create strip
ru: Создать штрих-код

source: Cut
ru: Вырезать

source: Delete
ru: Удалить

# Delete the existing file %@ by path %@ and start the process again.
source: Delete the existing file %1$@ by path %2$@ and start the process again.
ru: Удалите существующий файл %1$@ по пути %2$@ и запустите процесс заново.

source: Deleted
ru: Удалено

source: Deleted %d %@
ru: Удалено %d %@

source: Demo
ru: Демо

source: Disable
ru: Выключить

source: Dismiss
ru: Закрыть

source: Domination colors
ru: Доминирующие цвета

source: Donate
ru: Сделать взнос

source: Drag and drop files to the Drop video tab
ru: Перетащите файлы на вкладку бросить видео

source: Drag and drop files to the Grab queue tab
ru: Перетащите файлы на вкладку очередь захвата

source: Drag and drop files to the Image Colors tab
ru: Перетащите файлы на вкладку Цвета изображения

# Drag&Drop
source: Drag and drop the video files to the window
ru: Перетащите видео файлы в окно

# Drag&Drop Images
source: Drag and drop the image files to the window
ru: Перетащите изображения в окно

source: Drag&Drop video
ru: Импорт видео

source: Drop Video
ru: Бросить видео

source: Empty
ru: Пусто

source: Enable
ru: Включить

source: Error getting cache directory path
ru: Ошибка получения пути к каталогу кэша

source: Euclidean
ru: Евклидов

source: Excerpt
ru: Отрывок

source: Exclude black color
ru: Исключить черный цвет

source: Exclude white color
ru: Исключить белый цвет

source: Export
ru: Экспорт

source: Export all
ru: Экспорт всех

source: Export directory path
ru: Путь к каталогу экспорта

source: Export file format
ru: Формат экспорта файла

source: Export grabbed image file format
ru: Формата файла захваченного изображения

source: Export selected
ru: Экспорт выделенных

source: Extract color
ru: Извлечение цвета

source: failed
ru: не удалось

source: Failed to export video %@.
ru: Не удалось экспортировать видео %@.

source: Failed to merge image and strip
ru: Не удалось объединить изображение и полосу

source: File
ru: Файл

source: File name
ru: Имя файла

source: file type does not match the requirement
ru: тип файла не соответствует требованиям

source: File type to export when extracting color from an image
ru: Тип файла для экспорта при извлечении цвета из изображения

source: File type to export when grabbing video
ru: Тип файла для экспорта при захвате видео

source: Fill
ru: Заполнить

source: Finds the dominant colors of an image by iterating, grouping and sorting its pixels and using the difference between the colors.
ru: Находит доминирующие цвета изображения путем повторения, группировки и сортировки пикселей и использования разницы между цветами.

source: Finds the dominant colors of an image by using using a area average algorithm.
ru: Находит доминирующие цвета изображения, используя алгоритм усреднения по площади.

source: Finds the dominant colors of an image by using using a k-means clustering algorithm.
ru: Находит доминирующие цвета изображения с помощью алгоритма кластеризации k-средних.

source: Fit
ru: Вписать

source: Flags
ru: Флаги

source: Format
ru: Формат

source: Format not available
ru: Формат не доступен

source: Frame grabbing
ru: Захват кадров

source: Full
ru: Весь

source: General
ru: Общие

source: Get started
ru: Начать

source: Go to next frame
ru: На следующий кадр

source: Go to previous frame
ru: На предыдущий кадр

source: Grab
ru: Захват

source: Grab Frames
ru: Захват кадров

source: Grab Panel
ru: Панель захвата

source: Grab settings
ru: Настройки захвата

source: Grab shots compression ratio
ru: Коэффициент сжатия захваченных кадров

source: grabbed from
ru: захвачено c

source: Grabbing...
ru: Захват...

source: Gradient
ru: Градиент

source: Height strip
ru: Полоска высоты

source: Image
ru: Изображение

source: Image colors
ru: Цвета изображения

source: Image export settings
ru: Настройки экспорта изображений

source: Image size for video color strip
ru: Размер изображения для штрих-кода видео

source: Image Strip
ru: Штрих-код изображения

source: Images
ru: Изображения

source: Import files via the application menu
ru: Импорт файлов через меню приложения

source: Import files via the context menu in Grab tab
ru: Импортируйте файлы через контекстное меню на вкладке Захват

source: Import grabbed shots
ru: Импортировать захваченные кадры

source: Import Images
ru: Импорт изображений

source: Import the file %@ via File -> Import video or add access to the directory through the system privacy and security settings
ru: Импортируйте файл %@ через Файл -> Импортировать видео или добавьте доступ к каталогу через настройки конфиденциальности и безопасности системы.

source: Import Video URL From Clipboard
ru: Импорт URL видео из буфера обмена

source: Import Videos
ru: Импорт видео

source: Import videos from Vimeo or Youtube.
ru: Импортируйте видео с Vimeo или Youtube.

source: Importing images
ru: Импорт изображений

source: Invalid url.
ru: Неверная ссылка.

source: Invalid video id
ru: Неверный id видео

source: Key
ru: Ключ

source: Key combination
ru: Комбинация клавиш

source: loading...
ru: загрузка...

source: Location
ru: Размещение

source: Mark In
ru: Отметка входа

source: Mark Out
ru: Отметка выхода

source: Match Frame
ru: Захватить кадр

source: Metadata not available
ru: Метаданные не доступны

source: Method
ru: Метод

source: Method for creating a stripe
ru: Метод создания штрих-кода

source: Mute
ru: Отключить звук

source: Next
ru: Далее

source: No access for export folder
ru: Нет доступа к папке экспорта

source: No export folder selected for
ru: Не выбрана папка экспорта

source: No read access to file
ru: Нет доступа к чтению файла

source: Number of average colors
ru: Количество средних цветов

source: Number of colors
ru: Количество цветов

source: Open folder
ru: Открыть папку

source: Open folder with shots after capture
ru: Открыть папку после захвата

source: Open settings
ru: Открыть настройки

source: Overview
ru: Обзор

source: Path
ru: Путь

source: Pause
ru: Пауза

source: paused
ru: пауза

source: Perhaps the video is not supported or the link could not be obtained on the hosting server.
ru: Возможно видео не поддерживается или ссылку не удалось получить на хостинг-сервере.

source: Period
ru: Период

source: Pick color
ru: Выбор цвета

source: Picker
ru: Сборщик

source: Play
ru: Играть

source: Playback
ru: Просмотр

source: Playback Status: %@
ru: Плейбек статутс: %@

source: playing
ru: проигрование

source: Please select an export folder.
ru: Пожалуйста, выберите папку экспорта.

source: px
ru: пикс

source: Quality
ru: Качество

source: Quality for dominant colors algorithm
ru: Качество для алгоритма доминирующих цветов

source: Quit
ru: Завершить

source: Range
ru: Диапазон

source: Ready
ru: Готов

source: ready to play
ru: готов к проигрованию

source: Resume
ru: Продолжить

source: Sampling average colors from an image
ru: Выборка средних цветов из изображения

source: Sampling average colors from one grabbed frame
ru: Выборка средних цветов из одного захваченного кадра

source: Save image to grab folder
ru: Сохранить штрих-код в папку захвата

source: seconds
ru: секунд

source: Select custom color
ru: Выбрать цвет вручную

source: Select menu
ru: Выберите меню

source: Select the destination folder again.
ru: Снова выберите папку назначения.

source: Select the export folder for the video again
ru: Выберите папку экспорта для видео снова

source: Select the grabbing tab. Then select the export location and settings. To start the process, press the button on the control panel.
ru: Выберите вкладку захвата. Затем выберите место экспорта и настройки. Для запуска процесса нажмите кнопку на панели управления.

source: Select the image colors tab
ru: Выберите вкладку цвета изображения

source: Select video
ru: Выбрать видео

source: Settings
ru: Настройки

source: shots
ru: кадр(ов)

source: shots grabbed
ru: кадра(ов) захвачено

source: Show Color Barcode
ru: Показать цветной штрих-код

source: Show export directory
ru: Показать папку экспорта

source: Show GrabShot
ru: Показать GrabShot

source: Show in Finder
ru: Показать в Finder

source: Show metadata
ru: Показать метаданные

source: Show overview
ru: Показать обзор

source: Show Overview
ru: Показать обзор

source: Something went wrong
ru: Что-то пошло не так

source: Start
ru: Старт

source: Status Player: %@
ru: Статус плеера: %@

source: Status Time Control: %@
ru: Статус управления временем: %@

source: Status Video: %@
ru: Статус Видео: %@

source: Stream not available
ru: Поток не доступен

source: Streams
ru: Потоки

source: Strip
ru: Штрих-код

source: Strip colors not found or could not be createde
ru: Цвета полос не найдены или не могут быть созданы

source: Strip resolution
ru: Разрешение штрих-кода

source: Strip settings for image
ru: Настройки штрих-кода для изображения

source: Strip settings for video
ru: Настройки штрих-кода для видео

source: Stripe mode
ru: Тип штрих-кода

source: Tab Navigation Bar
ru: Панель вкладок навигации

source: The barcode will be extended at the bottom of the image
ru: Штрих-код будет расширен внизу изображения

source: The CIE94 algorithm is an improvement of CIE76, it calculates the difference in the Lab color space. Slightly slower than CIE76.
ru: Алгоритм CIE94 является улучшением CIE76, вычисляет разницу в цветовом пространстве Lab. Немного медленнее, чем CIE76.

source: The CIEDE2000 algorithm is the most accurate color comparison algorithm in the Lab color space. It is significantly slower than its predecessors.
ru: Алгоритм CIEDE2000 — наиболее точный алгоритм сравнения цветов в цветовом пространстве Lab. Он значительно медленнее своих предшественников.

source: The CMC algorithm calculates the difference in the LHS (Luminance, Chroma, Hue) color space.
ru: Алгоритм CMC вычисляет разницу в цветовом пространстве LHS (яркость, цветность, оттенок).

source: The image %@ is corrupted or does not exist.
ru: Изображение %@ повреждено или не существует.

source: The program was created with the support of the Russian Cinematographers Guild.
ru: Программа создана при поддержке Гильдии Кинооператоров России.

source: The ratio ranges from 0 (lowest) to 100% (highest)
ru: Коэффициент от 0 (самый низкий) до 100% (самый высокий)

source: The video has already been added before.
ru: Видео уже добавлено ранее.

source: The window consists of a pool of imported videos and a functional part. Click on the video and you will see the playback, settings and timeline panels in the functional part.
ru: Окно состоит из таблицы импортированных видео и функциональной части. Нажмите на видео и в функциональной части вы увидите панели воспроизведения, настроек и таймлайн.

source: The window consists of a table of imported videos. The first step is to select the export folder. Next, decide on the assortment, you can choose an excerpt or the whole. Specify the frame capture interval in seconds. Finally, click the Start button and manage the process.
ru: Окно состоит из таблицы импортированных видеороликов. Первым шагом является выбор папки экспорта. Далее определитесь с ассортиментом, вы можете выбрать отрывок или все целиком. Укажите интервал захвата кадра в секундах. Наконец, нажмите кнопку Пуск и управляйте процессом.

source: There are workspaces in the application
ru: В приложении есть рабочие области

source: This file is corrupted or not supported.
ru: Этот файл поврежден или не поддерживается.

source: Timeline
ru: Таймлайн

source: To change the application settings, click on the gear
ru: Для изменения настроек приложения нажмите на шестеренку

source: To get acquainted with the main functions of the application, click next or close the window
ru: Чтобы ознакомиться с основными функциями приложения нажмите кнопку далее или закройте окно

source: To get started with images, import the files. There are several options:
ru: Чтобы начать работу с изображениями, импортируйте файлы. Есть несколько вариантов:

source: To get started with the video, import the files. There are several options for this:
ru: Чтобы начать работу с видео, импортируйте файлы. Для этого есть несколько вариантов:

source: To select a grabbing type, select options in the Export Properties panel.
ru: Чтобы выбрать тип захвата, выберите параметры на панели «Свойства экспорта».

source: To select a workspace, use the tab navigation bar
ru: Для выбора рабочего пространства используйте панель навигации по вкладкам

source: Top
ru: Вверх

source: Try again.
ru: Попробуйте еще раз.

source: Try exporting the image separately
ru: Попробуйте экспортировать изображение отдельно

source: Try restarting the app.
ru: Попробуйте перезапустить приложение.

source: Try restarting the application and try again.
ru: Попробуйте перезапустить приложение и повторите попытку.

source: Try updating the application.
ru: Попробуйте обновить приложение.

source: Unable to create cache for video
ru: Не удается создать кэш для видео

source: Unable to render stripe image
ru: Невозможно отобразить цветовые полосы изображения

source: unknown
ru: неизвестный

source: Unknown error
ru: Неизвестная ошибка

source: Unknown reaction
ru: Неизвестная реакция

source: Unknown reason.
ru: Неизвестная реакция.

source: Use another file.
ru: Используйте другой файл.

source: Use files with extension
ru: Используйте файлы с расширением

source: Use working link.
ru: Используйте рабочую ссылку.

source: Value
ru: Значение

source: Version
ru: Версия

source: Video
ru: Видео

source: Video Details
ru: Детали видео

source: Video grab
ru: Захват видео

source: Video Grab
ru: Захват видео

source: Video grabbing
ru: Захват видео

source: Video grabbing settings
ru: Настройки захвата видео

source: Video import
ru: Импорт видео

source: Video is not supported
ru: Видео не поддерживается

source: Video link grab
ru: Захват ссылки на видео

source: Video not found.
ru: Видео не найдено.

source: Video pool
ru: Видео

source: waiting
ru: ожидание

source: Welcome to GrabShot
ru: Добро пожаловать в GrabShot

source: Would you like to make a donation to the Russian Guild of Cinematographers right now?
ru: Хотите ли вы сделать взнос на развитие Гильдии Кинооператоров России прямо сейчас?

source: You have grabbed %d shots of video.
ru: Вы захватили %d кадра(ов) видео.

source: Zoom In
ru: Приблизить

source: Zoom Out
ru: Отдалить

source: Сompression factor
ru: Коэффициент сжатия
